clc,clear,close all;
x=[0,1,2,3,4,5,6,7,8,9,10];
y=[2.51,3.3,4.04,4.7,5.22,5.54,5.78,5.4,5.57,5.7,5.8];
s=length(x);
N=eye(s);
N=N*2;
f0=0.8,f10=0.2;
b=zeros(s,1);
N(s,s-1)=1,N(1,2)=1;
for i = 2:s-1
    N(i,i-1)=(x(i)-x(i-1))/(x(i+1)-x(i-1));
    N(i,i+1)=1-N(i,i-1);
    b(i)=6*(((y(i+1)-y(i))/(x(i+1)-x(i))-(y(i)-y(i-1))/(x(i)-x(i-1)))/(x(i+1)-x(i-1)));
end
b(1)=6*(((y(2)-y(1))/(x(2)-x(1))-f0)/(x(2)-x(1)));
b(s)=6*((f10-(y(s)-y(s-1))/(x(s)-x(s-1)))/(x(s)-x(s-1)));
M=inv(N)*b;
S=zeros(s-1,5);
for j = 1:s-1
    S(j,1)=y(j);
    S(j,2)=((y(j+1)-y(j))/(x(j+1)-x(j))-((M(j)/3+M(j+1)/6))*(x(j+1)-x(j)));
    S(j,3)=M(j)/2;
    S(j,4)=(M(j+1)-M(j))/(6*(x(j+1)-x(j)));
    S(j,5)=S(j,1)+S(j,2)*(x(j+1)-x(j))/2+S(j,3)*((x(j+1)-x(j))/2).^2+S(j,4)*((x(j+1)-x(j))/2).^3;
end
n=size(S,1);
title('三次样条插值图像');
hold on;
for i=1:s
    m=x(i):(x(i+1)-x(i))/100:x(i+1);
    p=S(i,1)+S(i,2)*(m-x(i))+S(i,3)*(m-x(i)).^2+S(i,4)*(m-x(i)).^3;
    plot(m,p);
    plot(x(i),y(i),'o');
end